/*
package com.example.demo;

public enum Commands {
    REGISTER("Регистрация пользователя в систему"),
    EXIT("Завершение работы программы"),
    HELP("Вывод списка всех комманд системы"),
    SEARCH_BY_USER_LOGIN("Поиск пользователя по логину"),
    LOGOUT("Выход пользователя из системы"),
    READ_ALL_MESSAGE("Вывод всех сообщений авторизованного пользователя"),
    ALL_USERS("Вывод всех пользователей в системе"),
    SEND_MESSAGE("Отправка сообщения пользователю по его логину"),
    MAIL_INFO("Информация о количестве полученных сообщений"),
    INFO("Вывод информации о авторизованном пользователе");

    Commands(String description) {
    }
}
*/
